rajvisharia/DeathRace-Car_Racing_Game/lpc1758_freertos_Display/L5_Application/source/led_mat.cpp
/*
 * led_mat.cpp
 *
 *  Created on: Apr 28, 2018
 *      Author: Supradeep-PC
 */

#include "FreeRTOS.h"
#include "LPC17xx.h"
#include"led_mat.hpp"
#include <stdint.h>
#include "io.hpp"
#include "gpio.hpp"
#include "utilities.h"
#include "stdio.h"
#include "stdbool.h"
#include "printf_lib.h"
#include "string.h"
#include "stdlib.h"
///


/*
GPIO R1(P1_19);
GPIO G1(P1_20);
GPIO B1(P1_22);
GPIO R2(P1_23);
GPIO G2(P1_28);
GPIO B2(P1_29);

GPIO A(P1_30);
GPIO B(P1_31);
GPIO C(P2_0);
GPIO D(P2_1);
GPIO E(P2_2);

GPIO clk(P2_3);
GPIO lat(P2_4);
GPIO oe(P2_5);


*/

GPIO R1(P1_20);
GPIO G1(P2_7);
GPIO B1(P1_22);
GPIO R2(P1_23);
GPIO G2(P2_6);
GPIO B2(P1_28);

GPIO A(P1_29);
GPIO B(P2_5);
GPIO C(P2_0);
GPIO D(P2_4);
GPIO E(P1_19);

GPIO clk(P2_1);
GPIO lat(P2_3);
GPIO oe(P2_2);


uint8_t matrixbuff[MATRIX_NROWS][MATRIX_HEIGHT];


/*
 ** Initialize pins as output/input, high/low.
 */
void ledMat::displayInit()
{
    R1.setAsOutput();
    G1.setAsOutput();
    B1.setAsOutput();
    R2.setAsOutput();
    G2.setAsOutput();
    B2.setAsOutput();
    A.setAsOutput();
    B.setAsOutput();
    C.setAsOutput();
    D.setAsOutput();
    E.setAsOutput();
    clk.setAsOutput();
    lat.setAsOutput();
    oe.setAsOutput();

    R1.setLow();
    G1.setLow();
    B1.setLow();
    R2.setLow();
    G2.setLow();
    B2.setLow();
    A.setLow();
    B.setLow();
    C.setLow();
    D.setLow();
    E.setLow();
    clk.setLow();
    lat.setLow();
    oe.setLow();

    memset(matrixbuff, 0, MATRIX_HEIGHT * MATRIX_NROWS);
}


/*
 ** Function to glow a pixel.
 */
void ledMat::drawPixel(uint8_t x, uint8_t y, uint8_t color)
{
    matrixbuff[x][y] |= color;
}


/*
 ** Function to clear a pixel.
 */
void ledMat::clearPixel(uint8_t x, uint8_t y, uint8_t color)
{
    matrixbuff[x][y] &= ~(color);
}


/*
 ** Function to clear any particular section of the display or  entire display or .
 ** Can clear any particular color(s) in a section/entire display.
 ** To clear all colors from entire display, pass color as "cyan".
 */
void ledMat::clearDisplay(uint8_t color)
{
    for(uint8_t row = 0; row < 32; row++)
    {
        for(uint8_t col = 0; col < 64; col++)
        {
            clearPixel(row, col, color);
        }
    }
}

/*
 ** Function to update the display matrix.
 */
void ledMat::updateDisplay()
{
    for(uint8_t row = 0; row < 32; row++)
    {
        for(uint8_t col = 0; col < 64; col++)
        {

            if(matrixbuff[row][col] & 0x1)
            {
                B1.setHigh();
            }
            else
            {
                B1.setLow();
            }
            if(matrixbuff[row][col] & 0x2)
            {
                G1.setHigh();
            }
            else
            {
                G1.setLow();
            }
            if(matrixbuff[row][col] & 0x4)
            {
                R1.setHigh();
            }
            else
            {
                R1.setLow();
            }
            if(matrixbuff[row][col] & 0x8)
            {
                B2.setHigh();
            }
            else
            {
                B2.setLow();
            }
            if(matrixbuff[row][col] & 0x10)
            {
                G2.setHigh();
            }
            else
            {
                G2.setLow();
            }
            if(matrixbuff[row][col] & 0x20)
            {
                R2.setHigh();
            }
            else
            {
                R2.setLow();
            }

            clk.setHigh();
            clk.setLow();
        }

        oe.setHigh();
        lat.setHigh();

        A.setLow();
        B.setLow();
        C.setLow();
        D.setLow();
        E.setLow();

        if(row & 0x1)
        {
            A.setHigh();
        }

        if(row & 0x2)
        {
            B.setHigh();
        }

        if(row & 0x4)
        {
            C.setHigh();
        }

        if(row & 0x8)
        {
            D.setHigh();
        }

        if(row & 0x10)
        {
            E.setHigh();
        }

        lat.setLow();
        oe.setLow();
    }
}

/*
 ** Function to bring down the display by one pixel.
 */
void ledMat::moveDisplayDown()
{
    static uint8_t count = 0;
    uint8_t x, y;

    // From row 1 to row 31.
    for (x=1; x<31; x++)
    {
        // Column 7 to column 53.
        for (y=7; y < 53; y++)
        {
            // If less than col 52, then bring down.
            if (y < 52)
            {
                matrixbuff[x][y] = matrixbuff[x][y+1];
            }

            // If col = 52 (top most play area col), then clear.
            if (y == 52)
            {
                clearPixel(x, y, 63);

                count = (x == 9) ? count+1 : count;

                /*
                 ** For rows 10 & 21, print dotted lane lines.
                 ** Matching with dotted line function.
                 */
                if (x == 10 || x == 21)
                {

                    if (count == 4 || count == 5)
                    {
                        clearPixel(x, y, 63);
                        count = (count == 4) ? 0 : count;
                    }

                    else
                    {
                        drawPixel(x, y,cyan);
                    }
                }
            }
        }
    }
}


/*
 ** Function to check if the car hit the obstacle or no.
 ** Get the x coordinates of both cars from the Master module.
 */
/*
void ledMat::checkHit(uint8_t x1, uint8_t x2)
{
    uint8_t temp;

    for (int i=x1; i <= (x1+3); i++)
    {
        temp = matrixbuff[i][7];

        if ( (temp & 0x07) == 5)
        {
            LD.setNumber(x1);
            LE.on(1);
            break;
        }
        if ( (temp & 0x07) == 3)
        {
            LD.setNumber(x1);
            LE.on(2);

        }
        else
        {
            LE.off(1);
            LE.toggle(4);
            LD.setNumber(x1);
        }
    }

    for (int i=x2; i <= (x2+3); i++)
    {
        temp = matrixbuff[i][7];

        if ( (temp & 0x38) == 40)
        {
            LD.setNumber(x2);
            LE.on(1);
            break;
        }
        if ( (temp & 0x38) == 24)
        {
            LD.setNumber(x2);
            LE.on(2);

