rajvisharia/DeathRace-Car_Racing_Game/lpc1758_freertos_Display/L5_Application/source/led_mat.cpp
        }
        else
        {
             LE.off(1);
             LE.toggle(4);
             LD.setNumber(x1);
        }
    }
}

*/


/*
 ** Function to check if Player 1 car hit the obstacle or no.
 ** Get the x coordinate of the car from the Master module.
 ** Return an enum, "Collision".
 */
Collision ledMat::checkHitPlayer1(uint8_t x1)
{
    uint8_t temp;
    Collision mycarCollision;

    /*
     ** Car's width ranges from x to x+3.
     ** Check for obstacle for all values in this range.
     */
    for (int i=x1; i <= (x1+3); i++)
    {
        // Get the matrix cell value just above the car.
        temp = matrixbuff[i][7];

        // Checking for square obstacle (to be collected).
        if ( (temp & 0x07) == yellow1)
        {
            mycarCollision = hit_square;
            break;
            //return mycarCollision;
        }

        // Checking for triangular obstacle (to be avoided).
        if ( (temp & 0x07) == skyblue1)
        {
            mycarCollision = hit_triangle;
            break;
           //return mycarCollision;
        }

        else
        {
            mycarCollision = no_collide;
        }
    }

    return mycarCollision;
}


/*
 ** Function to check if Player 2 car hit the obstacle or no.
 ** Get the x coordinate of the car from the Master module.
 ** Return an enum, "Collision".
 */
Collision ledMat::checkHitPlayer2(uint8_t x2)
{
    uint8_t temp;
    Collision mycarCollision;


    for (int i=x2; i <= (x2+3); i++)
    {
        temp = matrixbuff[i][7];

        if ( (temp & 0x38) == yellow2)
        {
            mycarCollision = hit_square;
            break;
            //return mycarCollision;
        }

        if ( (temp & 0x38) == skyblue2)
        {
            mycarCollision = hit_triangle;
            break;
            //return mycarCollision;

        }

        else
        {
            mycarCollision=no_collide;
        }
    }
    return mycarCollision;
}

void ledMat::drawCrash(uint8_t x, uint8_t y, uint8_t color1, uint8_t color2)
{
    //drawLine(x, y+4, x+3, y+4, color1);
    drawLine(x, y+5, x+3, y+5, color1);
    drawPixel(x, y+6, color2);  drawLine(x+1, y+6, x+2, y+6, color1); //drawPixel(x+3, y+6, color2);
    drawPixel(x+1, y+7, color2); drawPixel(x+2, y+7, color2);
    drawPixel(x, y+8, color2);

    if (x>1)
    {
        //drawPixel(x-1, y+5, color2);
        //drawPixel(x-3, y+6, color2);
        //drawPixel(x-2, y+7, color2);
    }
    if (x<27)
    {
        //drawPixel(x+4, y+5, color2);
        //drawPixel(x+6, y+6, color2);
        //drawPixel(x+5, y+7, color2);
    }

}


/*
 ** Function to draw line between 2 points.
 */
void ledMat::drawLine(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t color)
{
      int16_t steep = abs(y1 - y0) > abs(x1 - x0);
      if (steep) {
        swap(x0, y0);
        swap(x1, y1);
      }

      if (x0 > x1)
      {
        swap(x0, x1);
        swap(y0, y1);
      }

      int16_t dx, dy;
      dx = x1 - x0;
      dy = abs(y1 - y0);

      int16_t err = dx / 2;
      int16_t ystep;

      if (y0 < y1)
      {
        ystep = 1;
      }

      else
      {
        ystep = -1;
      }

      for (; x0<=x1; x0++)
      {
        if (steep)
        {
          drawPixel(y0, x0, color);
        }

        else
        {
          drawPixel(x0, y0, color);
        }

        err -= dy;

        if (err < 0)
        {
          y0 += ystep;
          err += dx;
        }
      }
}


/*
 ** Function to display dotted lanes.
 */
void ledMat::drawLineDotted(uint8_t x, uint8_t w, uint8_t color)
{
    for (int i = 1; i < 52; )
    {
        drawLine(x, i, x, i+w-1, color);
        i +=5;
    }
}


/*
 ** Function to display the border grid and center partition.
 */
void ledMat::drawFrame()
{
    drawLine(0, 0, 0, 63, purple);      // Row: 0 & 32
    //drawLine(0, 0, 0, 63, purple1);
    //drawLine(0, 0, 0, 53, purple2);

    drawLine(31, 0, 31, 63, purple);    // Row: 31 & 63
    //drawLine(31, 0, 31, 53, purple1);
    //drawLine(31, 0, 31, 63, purple2);

    drawLine(0, 0, 31, 0, purple);      // Column: 0
    drawLine(1, 53, 30, 53, purple);      // Column: 0
    drawLine(0, 63, 31, 63, purple);    // Column: 63
}


/*
 ** Function to display circular obstacle.
 ** Not using this for the moment.
 */
void ledMat::drawObstacleCircle(uint8_t x, uint8_t y, uint8_t color)
{
                                                          drawPixel(x, y+2, color);
                              drawPixel(x-1, y+1, color); drawPixel(x, y+1, color); drawPixel(x+1, y+1, color);
    drawPixel(x-2, y, color); drawPixel(x-1, y, color);   drawPixel(x, y, color);   drawPixel(x+1, y, color);   drawPixel(x+2, y, color);
                              drawPixel(x-1, y-1, color); drawPixel(x, y-1, color); drawPixel(x+1, y-1, color);
                                                          drawPixel(x, y-2, color);

}


/*
 ** Function to draw triangular obstacle.
 */
void ledMat::drawObstacleTriangle(uint8_t x, uint8_t y, uint8_t w, uint8_t h, uint8_t color1, uint8_t color2)
{
    // To get hollow triangle.
    drawLine(x, y, x+w, y, color1);    // Bottom row
    drawPixel(x, y+1, color1);
    drawPixel(x+w, y+1, color1);
    drawPixel(x+1, y+2, color1);
    drawPixel(x+w-1, y+2, color1);
    drawPixel(x+w/2, y+3, color1);

    // To fill the triangle.
    drawLine(x+1, y+1, x+w-1, y+1, color2);
    drawPixel(x+2, y+2, color2);

}


/*
 ** Function to draw square obstacle.
 */
void ledMat::drawObstacleSquare(uint8_t x, uint8_t y, uint8_t s, uint8_t color, uint8_t color1)
{
    //drawPixel(x+1, y,color1);  drawPixel(x+2,y, color1);   drawPixel(x+3, y, color1);  drawPixel(x+4, y, color1);
    //drawPixel(x+1,y+1,color1); drawPixel(x+2,y+1,color1);  drawPixel(x+3,y+1,color1);  drawPixel(x+4,y+1,color1);
    //drawPixel(x+1,y+2,color1); drawPixel(x+2,y+2,color1);  drawPixel(x+3,y+2,color1);  drawPixel(x+4,y+2,color1);
    //drawPixel(x+1,y+3,color1); drawPixel(x+2,y+3,color1);  drawPixel(x+3,y+3,color1);  drawPixel(x+4,y+3,color1);
    //drawPixel(x+1,y+4,color1); drawPixel(x+2,y+4,color1);  drawPixel(x+3,y+4,color1);  drawPixel(x+4,y+4,color1);

    drawLine(x, y, x+s, y, color);
    drawLine(x, y, x, y+s, color);
    drawLine(x+s, y, x+s, y+s, color);
    drawLine(x, y+s, x+s, y+s, color);
    drawPixel(x+1,y+1, color1);
    drawPixel(x+2, y+1, color1);
    drawPixel(x+1,y+2, color1);
    drawPixel(x+2, y+2, color1);
}


