rajvisharia/DeathRace-Car_Racing_Game/lpc1758_freertos_Display/L5_Application/source/led_mat.cpp
/*
 ** Function to display car.
 */
void ledMat::drawCar(uint8_t x, uint8_t y, uint8_t color1, uint8_t color2)
{
        drawPixel(x, y,color1);                                                 drawPixel(x+3, y, color1);
                             drawPixel(x+1,y+1,color1);  drawPixel(x+2,y+1,color1);
                             drawPixel(x+1,y+2,color1);  drawPixel(x+2,y+2,color1);
                             drawPixel(x+1,y+3,color1);  drawPixel(x+2,y+3,color1);
        drawPixel(x,y+4,color1);                                                drawPixel(x+3,y+4,color1);

}


/*
 ** Function to clear car's last position.
 */
void ledMat::clearCar(uint8_t x, uint8_t y, uint8_t color1, uint8_t color2)
{
    for(uint8_t i = x; i <= (x+3); i++)
    {
        for(uint8_t j = y; j <= (y+4); j++)
        {
            clearPixel(i, j, color1);
            //clearPixel(i, j, color2);     // If we are using 2 colors for car, clear other color too if using.
        }
    }
}


void ledMat::drawDigit(uint8_t x0, uint8_t y0, uint8_t value, uint8_t color)
{
    if(value == 0)
    {
       drawPixel(x0, y0+1, color);
       drawPixel(x0, y0+2, color);
       drawPixel(x0, y0+3, color);
       drawPixel(x0, y0+4, color);
       drawPixel(x0, y0+5, color);
       drawPixel(x0, y0+6, color);
       drawPixel(x0+1, y0, color);
       drawPixel(x0+1, y0+7, color);
       drawPixel(x0+2, y0, color);
       drawPixel(x0+2, y0+7, color);
       drawPixel(x0+3, y0, color);
       drawPixel(x0+3, y0+7, color);
       drawPixel(x0+4, y0+1, color);
       drawPixel(x0+4, y0+2, color);
       drawPixel(x0+4, y0+3, color);
       drawPixel(x0+4, y0+4, color);
       drawPixel(x0+4, y0+5, color);
       drawPixel(x0+4, y0+6, color);
    }

    else if(value == 1)
    {
       drawPixel(x0+1, y0, color);
       drawPixel(x0+1, y0+6, color);
       drawPixel(x0+2, y0, color);
       drawPixel(x0+2, y0+1, color);
       drawPixel(x0+2, y0+2, color);
       drawPixel(x0+2, y0+3, color);
       drawPixel(x0+2, y0+4, color);
       drawPixel(x0+2, y0+5, color);
       drawPixel(x0+2, y0+6, color);
       drawPixel(x0+2, y0+7, color);
       drawPixel(x0+3, y0, color);
    }

    else if(value == 2)
    {
       drawPixel(x0, y0, color);
       drawPixel(x0, y0+1, color);
       drawPixel(x0, y0+2, color);
       drawPixel(x0, y0+6, color);
       drawPixel(x0+1, y0, color);
       drawPixel(x0+1, y0+3, color);
       drawPixel(x0+1, y0+7, color);
       drawPixel(x0+2, y0, color);
       drawPixel(x0+2, y0+3, color);
       drawPixel(x0+2, y0+7, color);
       drawPixel(x0+3, y0, color);
       drawPixel(x0+3, y0+4, color);
       drawPixel(x0+3, y0+7, color);
       drawPixel(x0+4, y0, color);
       drawPixel(x0+4, y0+1, color);
       drawPixel(x0+4, y0+5, color);
       drawPixel(x0+4, y0+6, color);
    }

    else if(value == 3)
    {
       drawPixel(x0, y0+1, color);
       drawPixel(x0, y0+6, color);
       drawPixel(x0+1, y0, color);
       drawPixel(x0+1, y0+4, color);
       drawPixel(x0+1, y0+7, color);
       drawPixel(x0+2, y0, color);
       drawPixel(x0+2, y0+4, color);
       drawPixel(x0+2, y0+7, color);
       drawPixel(x0+3, y0, color);
       drawPixel(x0+3, y0+4, color);
       drawPixel(x0+3, y0+7, color);
       drawPixel(x0+4, y0+1, color);
       drawPixel(x0+4, y0+2, color);
       drawPixel(x0+4, y0+3, color);
       drawPixel(x0+4, y0+5, color);
       drawPixel(x0+4, y0+6, color);
    }

    else if(value == 4)
    {
       drawPixel(x0, y0+2, color);
       drawPixel(x0, y0+3, color);
       drawPixel(x0, y0+4, color);
       drawPixel(x0+1, y0+2, color);
       drawPixel(x0+1, y0+5, color);
       drawPixel(x0+2, y0+2, color);
       drawPixel(x0+2, y0+6, color);
       drawPixel(x0+3, y0, color);
       drawPixel(x0+3, y0+1, color);
       drawPixel(x0+3, y0+2, color);
       drawPixel(x0+3, y0+3, color);
       drawPixel(x0+3, y0+4, color);
       drawPixel(x0+3, y0+7, color);
       drawPixel(x0+4, y0+2, color);
    }

    else if(value == 5)
    {
       drawPixel(x0, y0+1, color);
       drawPixel(x0, y0+5, color);
       drawPixel(x0, y0+6, color);
       drawPixel(x0, y0+7, color);
       drawPixel(x0+1, y0, color);
       drawPixel(x0+1, y0+4, color);
       drawPixel(x0+1, y0+7, color);
       drawPixel(x0+2, y0, color);
       drawPixel(x0+2, y0+4, color);
       drawPixel(x0+2, y0+7, color);
       drawPixel(x0+3, y0, color);
       drawPixel(x0+3, y0+4, color);
       drawPixel(x0+3, y0+7, color);
       drawPixel(x0+4, y0+1, color);
       drawPixel(x0+4, y0+2, color);
       drawPixel(x0+4, y0+3, color);
       drawPixel(x0+4, y0+7, color);
    }

    else if(value == 6)
    {
       drawPixel(x0, y0+1, color);
       drawPixel(x0, y0+2, color);
       drawPixel(x0, y0+3, color);
       drawPixel(x0, y0+4, color);
       drawPixel(x0, y0+5, color);
       drawPixel(x0, y0+6, color);
       drawPixel(x0+1, y0, color);
       drawPixel(x0+1, y0+4, color);
       drawPixel(x0+1, y0+7, color);
       drawPixel(x0+2, y0, color);
       drawPixel(x0+2, y0+4, color);
       drawPixel(x0+2, y0+7, color);
       drawPixel(x0+3, y0, color);
       drawPixel(x0+3, y0+4, color);
       drawPixel(x0+3, y0+7, color);
       drawPixel(x0+4, y0+1, color);
       drawPixel(x0+4, y0+2, color);
       drawPixel(x0+4, y0+3, color);
       drawPixel(x0+4, y0+6, color);
    }

    else if(value == 7)
    {
       drawPixel(x0, y0+7, color);
       drawPixel(x0+1, y0+7, color);
       drawPixel(x0+2, y0, color);
       drawPixel(x0+2, y0+1, color);
       drawPixel(x0+2, y0+2, color);
       drawPixel(x0+2, y0+3, color);
       drawPixel(x0+2, y0+7, color);
       drawPixel(x0+3, y0+4, color);
       drawPixel(x0+3, y0+7, color);
       drawPixel(x0+4, y0+5, color);
       drawPixel(x0+4, y0+6, color);
       drawPixel(x0+4, y0+7, color);
    }

    else if(value == 8)
    {
       drawPixel(x0, y0+1, color);
       drawPixel(x0, y0+2, color);
       drawPixel(x0, y0+3, color);
       drawPixel(x0, y0+5, color);
       drawPixel(x0, y0+6, color);
       drawPixel(x0+1, y0, color);
       drawPixel(x0+1, y0+4, color);
       drawPixel(x0+1, y0+7, color);
       drawPixel(x0+2, y0, color);
       drawPixel(x0+2, y0+4, color);
       drawPixel(x0+2, y0+7, color);
       drawPixel(x0+3, y0, color);
       drawPixel(x0+3, y0+4, color);
       drawPixel(x0+3, y0+7, color);
       drawPixel(x0+4, y0+1, color);
       drawPixel(x0+4, y0+2, color);
       drawPixel(x0+4, y0+3, color);
       drawPixel(x0+4, y0+5, color);
       drawPixel(x0+4, y0+6, color);
    }

