rajvisharia/DeathRace-Car_Racing_Game/lpc1758_freertos_Display/L5_Application/source/led_mat.cpp
    else if(value == 9)
    {
       drawPixel(x0, y0+1, color);
       drawPixel(x0, y0+4, color);
       drawPixel(x0, y0+5, color);
       drawPixel(x0, y0+6, color);
       drawPixel(x0+1, y0, color);
       drawPixel(x0+1, y0+3, color);
       drawPixel(x0+1, y0+7, color);
       drawPixel(x0+2, y0, color);
       drawPixel(x0+2, y0+3, color);
       drawPixel(x0+2, y0+7, color);
       drawPixel(x0+3, y0, color);
       drawPixel(x0+3, y0+3, color);
       drawPixel(x0+3, y0+7, color);
       drawPixel(x0+4, y0+1, color);
       drawPixel(x0+4, y0+2, color);
       drawPixel(x0+4, y0+3, color);
       drawPixel(x0+4, y0+4, color);
       drawPixel(x0+4, y0+5, color);
       drawPixel(x0+4, y0+6, color);
    }
}



/*
 ** Function to display numbers on the screen.
 */
void ledMat::drawNumbers(uint8_t x0, uint8_t y0, uint8_t value, uint8_t color)
{
    uint8_t num[2] = {};

    num[0] = value / 10;
    num[1] = value % 10;

    for(uint8_t i = 0; i < 2; i++)
    {
        x0 = (i == 1)? x0+7 : x0;

        drawDigit(x0, y0, num[i], color);
    }
}


void ledMat::drawLetter(uint8_t x, uint8_t y, char alpha, uint8_t color)
{
    if (alpha == 'a' || alpha == 'A')
    {


                                                               drawPixel(x+2, y+4, color);
                                   drawPixel(x+1, y+3, color);                             drawPixel(x+3, y+3, color);
                         drawPixel(x, y+2, color);                                                             drawPixel(x+4, y+2, color);
         drawPixel(x, y+1, color); drawPixel(x+1, y+1, color); drawPixel(x+2, y+1, color); drawPixel(x+3, y+1, color); drawPixel(x+4, y+1, color);
        drawPixel(x, y, color);                                                                                 drawPixel(x+4, y, color);
    }

    if (alpha == 'c' || alpha == 'C')
    {
        drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color); //drawPixel(x+4, y+4, color);
        drawPixel(x, y+3, color);
        drawPixel(x, y+2, color);
        drawPixel(x, y+1, color);
        drawPixel(x+1, y, color); drawPixel(x+2, y, color); drawPixel(x+3, y, color); //drawPixel(x+4, y, color);
    }

    if (alpha == 'd' || alpha == 'D')
    {
        drawPixel(x, y+4, color); drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color);
        drawPixel(x, y+3, color); drawPixel(x+4, y+3, color);
        drawPixel(x, y+2, color); drawPixel(x+4, y+2, color);
        drawPixel(x, y+1, color); drawPixel(x+4, y+1, color);
        drawPixel(x, y, color); drawPixel(x+1, y, color); drawPixel(x+2, y, color); drawPixel(x+3, y, color);
    }

    if (alpha == 'e' || alpha == 'E')
    {
        drawPixel(x, y+4, color); drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color); drawPixel(x+4, y+4, color);
        drawPixel(x, y+3, color);
        drawPixel(x, y+2, color); drawPixel(x+1, y+2, color); drawPixel(x+2, y+2, color); drawPixel(x+3, y+2, color);
        drawPixel(x, y+1, color);
        drawPixel(x, y, color); drawPixel(x+1, y, color); drawPixel(x+2, y, color); drawPixel(x+3, y, color); drawPixel(x+4, y, color);
    }

    if (alpha =='h' || alpha =='H')
    {
        drawPixel(x, y+4, color);                                       drawPixel(x+4, y+4, color);
        drawPixel(x, y+3, color);                                       drawPixel(x+4, y+3, color);
        drawPixel(x, y+2, color); drawPixel(x+1, y+2, color); drawPixel(x+2, y+2, color); drawPixel(x+3, y+2, color); drawPixel(x+4, y+2, color);
        drawPixel(x, y+1, color); drawPixel(x+4, y+1, color);
        drawPixel(x, y, color);  drawPixel(x+4, y, color);
    }

    if (alpha == 'i' || alpha == 'I')
    {
                                            drawPixel(x+2, y+4, color);
        //drawPixel(x, y+4, color); drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color); drawPixel(x+4, y+4, color);
                                            drawPixel(x+2, y+3, color);
                                            drawPixel(x+2, y+2, color);
                                            drawPixel(x+2, y+1, color);
        //drawPixel(x, y, color); drawPixel(x+1, y, color); drawPixel(x+2, y, color); drawPixel(x+3, y, color); drawPixel(x+4, y, color);
                                            drawPixel(x+2, y, color);
    }

    if (alpha == 'l' || alpha == 'L')
    {
        drawPixel(x, y+4, color);
        drawPixel(x, y+3, color);
        drawPixel(x, y+2, color);
        drawPixel(x, y+1, color);
        drawPixel(x, y, color); drawPixel(x+1, y, color); drawPixel(x+2, y, color); drawPixel(x+3, y, color); drawPixel(x+4, y, color);
    }

    if (alpha =='n' || alpha =='N')
    {
        drawPixel(x, y+4, color);                               drawPixel(x+4, y+4, color);
        drawPixel(x, y+3, color);  drawPixel(x+1, y+3, color);  drawPixel(x+4, y+3, color);
        drawPixel(x, y+2, color); drawPixel(x+2, y+2, color);   drawPixel(x+4, y+2, color);
        drawPixel(x, y+1, color);  drawPixel(x+3, y+1, color);  drawPixel(x+4, y+1, color);
        drawPixel(x, y, color);  drawPixel(x+4, y, color);
    }

    if (alpha == 'o' || alpha == 'O')
    {
        drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color);
        drawPixel(x, y+3, color); drawPixel(x+4, y+3, color);
        drawPixel(x, y+2, color); drawPixel(x+4, y+2, color);
        drawPixel(x, y+1, color); drawPixel(x+4, y+1, color);
         drawPixel(x+1, y, color); drawPixel(x+2, y, color); drawPixel(x+3, y, color);
    }

    if (alpha == 'p' || alpha == 'P')
    {
        drawPixel(x, y+4, color); drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color);
        drawPixel(x, y+3, color);                                                               drawPixel(x+4, y+3, color);
        drawPixel(x, y+2, color); drawPixel(x+1, y+2, color); drawPixel(x+2, y+2, color); drawPixel(x+3, y+2, color);
        drawPixel(x, y+1, color);
        drawPixel(x, y, color);
    }

    if (alpha == 'r' || alpha == 'R')
    {
       drawPixel(x, y+4, color); drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color);
       drawPixel(x, y+3, color);                                                               drawPixel(x+4, y+3, color);
       drawPixel(x, y+2, color); drawPixel(x+1, y+2, color); drawPixel(x+2, y+2, color); drawPixel(x+3, y+2, color);
       drawPixel(x, y+1, color);                                                              drawPixel(x+4, y+1, color);
       drawPixel(x, y, color);                                                              drawPixel(x+4, y, color);
    }

    if (alpha == 's' || alpha == 'S')
    {
                    drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color); drawPixel(x+4, y+4, color);
        drawPixel(x, y+3, color);
                    drawPixel(x+1, y+2, color); drawPixel(x+2, y+2, color); drawPixel(x+3, y+2, color);
                                                                                    drawPixel(x+4, y+1, color);
        drawPixel(x, y, color); drawPixel(x+1, y, color); drawPixel(x+2, y, color); drawPixel(x+3, y, color);
    }

    if (alpha == 't' || alpha == 'T')
    {
        drawPixel(x, y+4, color); drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color); drawPixel(x+4, y+4, color);
                                                    drawPixel(x+2, y+3, color);
                                                    drawPixel(x+2, y+2, color);
                                                    drawPixel(x+2, y+1, color);
                                                    drawPixel(x+2, y, color);
    }

    if (alpha == 'w' || alpha == 'W')
    {
        drawPixel(x, y+4, color);                                       drawPixel(x+4, y+4, color);
        drawPixel(x, y+3, color);                                       drawPixel(x+4, y+3, color);
        drawPixel(x, y+2, color); drawPixel(x+2, y+2, color);  drawPixel(x+4, y+2, color);
        drawPixel(x, y+1, color); drawPixel(x+1, y+1, color);drawPixel(x+3, y+1, color);drawPixel(x+4, y+1, color);
        drawPixel(x, y, color);  drawPixel(x+4, y, color);
    }

    if (alpha == 'y' || alpha == 'Y')
    {
        drawPixel(x, y+4, color);                           drawPixel(x+4, y+4, color);
                  drawPixel(x+1, y+3, color); drawPixel(x+3, y+3, color);
                                drawPixel(x+2, y+2, color);
                                drawPixel(x+2, y+1, color);
                                drawPixel(x+2, y, color);
    }

    if (alpha == '1')
    {
        drawPixel(x+2, y+4, color);
        drawPixel(x+1, y+3, color); drawPixel(x+2, y+3, color);
                                         drawPixel(x+2, y+2, color);
                                         drawPixel(x+2, y+1, color);
        drawPixel(x+1, y, color); drawPixel(x+2, y, color); drawPixel(x+3, y, color);

