rajvisharia/DeathRace-Car_Racing_Game/lpc1758_freertos_Display/L5_Application/source/led_mat.cpp
    }

    if (alpha == '2')
    {
        drawPixel(x, y+4, color);drawPixel(x+1, y+4, color); drawPixel(x+2, y+4, color); drawPixel(x+3, y+4, color);
                                                                                            drawPixel(x+4, y+3, color);
                            drawPixel(x+1, y+2, color); drawPixel(x+2, y+2, color); drawPixel(x+3, y+2, color);
         drawPixel(x, y+1, color);
        drawPixel(x, y, color); drawPixel(x+1, y, color); drawPixel(x+2, y, color); drawPixel(x+3, y, color);  drawPixel(x+4, y, color);
    }
}


void ledMat::drawGameName(uint8_t x, uint8_t y)
{
    uint8_t color1 = red1;
    uint8_t color2 = red2;

    drawLetter(x+1, y, 'd', color1);     // 10+1, 40
    drawLetter(x+8, y, 'e', color1);
    drawLetter(x+15, y, 'a', color1);
    drawLetter(x-10, y, 't', color2);
    drawLetter(x-3, y, 'h', color2);

    drawLetter(x-10, y-8, 'r', color2);
    drawLetter(x-3, y-8, 'a', color2);
    drawLetter(x+4, y-8, 'c', color2);
    drawLetter(x+11, y-8, 'e', color2);

}

void ledMat::drawStartCondition(uint8_t x, uint8_t y)
{
    uint8_t color1 = cyan1;
    uint8_t color2 = cyan2;

    drawLetter(x, y, 'p', color1);
    drawLetter(x+6, y, 'r', color1);
    drawLetter(x+12, y, 'e', color1);
    drawLetter(x+18, y, 's', color1);
    drawLetter(x+24, y, 's', color1);

    drawLetter(x, y, 's', color2);
    drawLetter(x+6, y, 'w', color2);
    //drawPixel(x+13,y+2, color2);
    //drawPixel(x+14,y+2, color2);
    //drawPixel(x+15,y+2, color2);
    //drawLetter(x+16, y, '1', color2);
    drawLetter(x+10, y, 'i', color2);
    drawLetter(x+14, y, 't', color2);
    drawLetter(x+19, y, 'c', color2);
    drawLetter(x+24, y, 'h', color2);

    drawLetter(x+16, y-8, 't', color1);
    drawLetter(x+22, y-8, 'o', color1);

    drawLetter(x-1, y-8, 's', color2);
    drawLetter(x+5, y-8, 't', color2);
    drawLetter(x+11, y-8, 'a', color2);
    drawLetter(x+17, y-8, 'r', color2);
    drawLetter(x+23, y-8, 't', color2);

}

void ledMat::drawPlayerReady(uint8_t x, uint8_t y, uint8_t color)
{
    drawLetter(x, y, 'r', color);
    drawLetter(x+6, y, 'e', color);
    drawLetter(x+12, y, 'a', color);
    drawLetter(x+18, y, 'd', color);
    drawLetter(x+24, y, 'y', color);
}

void ledMat::drawCountDown(uint8_t x, uint8_t y)
{
    uint8_t color1 = skyblue1;
    uint8_t color2 = skyblue2;

    drawDigit(x, y, 3, color1);
    drawPixel(x+6, y, color1);
    drawPixel(x+8, y, color1);
    drawPixel(x+10, y, color1);
    delay_ms(1000);


    drawDigit(x+16, y, 2, color1);
    drawPixel(x+22, y, color1);
    drawPixel(x+24, y, color1);
    drawPixel(x+26, y, color1);
    delay_ms(1000);


    drawDigit(x, y, 1, color2);
    drawPixel(x+6, y, color2);
    drawPixel(x+8, y, color2);
    drawPixel(x+10, y, color2);
    delay_ms(1000);

    drawDigit(x+16, y, 0, color2);
    drawPixel(x+22, y, color2);
    drawPixel(x+24, y, color2);
    drawPixel(x+26, y, color2);
    delay_ms(1000);
}


void ledMat::drawStartWord(uint8_t x, uint8_t y)
{
    uint8_t color1 = skyblue1;
    uint8_t color2 = skyblue2;

    drawLetter(x+1, y, 's', color1);
    drawLetter(x+8, y, 't', color1);
    drawLetter(x+15, y, 'a', color1);
    drawLetter(x-10, y, 'r', color2);
    drawLetter(x-3, y, 't', color2);
    drawPixel(x+4, y, color2);
    drawPixel(x+7, y, color2);
    drawPixel(x+10, y, color2);
}


void ledMat::drawWinner(uint8_t x, uint8_t y, char player_number)
{
    uint8_t color1;
    uint8_t color2;

    if (player_number == '1')
    {
        color1 = red1;
        color2 = red2;
    }
    else
    {
        color1 = blue1;
        color2 = blue2;
    }


    drawLetter(x, y, 'p', color1);
    drawLetter(x+6, y, 'l', color1);
    drawLetter(x+12, y, 'a', color1);
    drawLetter(x+18, y, 'y', color1);
    drawLetter(x-x, y, 'e', color2);
    drawLetter(x-x+6, y, 'r', color2);

    drawPixel(x-x+13, y+2, color2);
    drawPixel(x-x+14, y+2, color2);
    drawPixel(x-x+15, y+2, color2);

    drawLetter(x-x+17, y, player_number, color2);

    drawLetter(x+12, y-8, 'w', color1);
    drawLetter(x+18, y-8, 'i', color1);
    drawLetter(x-x, y-8, 'n', color2);
    drawLetter(x-x+6, y-8, 's', color2);
    drawLine(x-x+13, y-6, x-x+13, y-4, color2);
    drawPixel(x-x+13, y-8, color2);
}


void ledMat::drawDraw(uint8_t x, uint8_t y)
{
    uint8_t color1 = green1;
    uint8_t color2 = green2;

    drawLetter(x, y, 'd', color1);
    drawLetter(x+6, y, 'r', color1);
    drawLetter(x-x, y, 'a', color2);
    drawLetter(x-x+6, y, 'w', color2);
    drawLine(x-x+13, y+2, x-x+13, y+4, color2);
    drawPixel(x-x+13, y, color2);
}


void ledMat::drawTime(uint8_t x0, uint8_t y0, uint8_t value, uint8_t color1, uint8_t color2)
{
    uint8_t num[2] = {};
    uint8_t color;
    num[0] = value / 10;
    num[1] = value % 10;


    for(uint8_t i = 0; i < 2; i++)
    {
        x0 = (i == 1)? (x0 - 24) : x0;

        if (i==0)
            color = color1;
        if (i==1)
            color = color2;

        drawDigit(x0, y0, num[i], color);
    }
}


/*
 ** Function to clear time at specific location.
 */
void ledMat::clearTime(uint8_t x0, uint8_t y0, uint8_t color1, uint8_t color2)
{
    for(uint8_t i = 0; i < 5; i++)
    {
        for(uint8_t j = 0; j < 8; j++)
        {
            clearPixel(i+x0, j+y0, color1);
            clearPixel(i+(x0-24), j+y0, color2);
        }
    }
}


/*
 ** Function to clear numbers at specific location.
 */
void ledMat::clearNumbers(uint8_t x0, uint8_t y0, uint8_t color)
{
    for(uint8_t i = 0; i < 5; i++)
    {
        for(uint8_t j = 0; j < 8; j++)
        {
            clearPixel(i+x0, j+y0, color);
            clearPixel(i+x0+7, j+y0, color);
        }
    }
}
